# 1. Introduction

# 2. Data Types

# 2.1 Variables

In [2]:
counter = 100.00 #float type variable
miles = 100 #integer type variable
name = "Mehvish" #string type variable
#print all values 
print (counter) 
print (miles) 
print (name)

100.0
100
Mehvish

 # 2.2 Numbers

In [3]:
2 #integer

2

In [4]:
2+3 #integer

5

In [5]:
 2.3+5.5 #float

7.8

In [6]:
2**2 #exponent

4

# 2.3 Strings

In [8]:
name = 'Mehvish'
university = "COMSATS"
print(name,university)

Mehvish COMSATS

# Access values in String

In [9]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0]) 
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

# Updating String

In [10]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python" 
print("Updated string: ", stringVariable)

Updated string:  Hello Python

# Delete String

In [11]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable
print (stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

# String special operators

In [12]:
variable = "Hello"
print(variable+"Python")

HelloPython

In [13]:
variable = "Hello"
print(variable*3)

HelloHelloHello

In [40]:
variable = "Hello"
print(variable[1])

e

In [15]:
variable = "Hello"
print(variable[1:3])

el

In [16]:
variable = "Hello"
print('H' in variable)

True

In [17]:
variable = "Hello"
print('G' not in variable)

True

# String formatting operator

In [18]:
print ("My name is %s and age is %d kg!" % ("Zara",21))

My name is Zara and age is 21 kg!

# 2.4 Lists

In [19]:
list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

# Accessing values in Lists

In [20]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ]; 
print ("list1[0]: ", list1[0]) 
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

# Updating Lists

In [21]:
list1 = ['physics', 'chemistry', 1997, 2000];
list1[1] = "computer science"
print(list1) 
list1.append('Computer Science') 
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

# Delete List element

In [22]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1) 
del list1[2];
print ("After deleting value at index 2 : ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

In [23]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1) 
list1.remove('chemistry')
print ("After deleting value at index 2 : ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

# 2.5 Dictionaries

# Accessing value in Dictionary

In [24]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict['Name'])

Mehvish

# Updating Dictionary

In [25]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "SP14"
print (dict) 
dict['University'] = "COMSATS" 
print(dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}

# Delete Dictionary Element

In [26]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014} 
print (dict) 
del dict['Batch'] 
print (dict)

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Mehvish', 'Depart': 'BCS'}

In [27]:
dict = {'Name':"Mehvish", 'Depart': "BCS", 'Batch': 2014} 
dict.clear() 
print (dict)

{}

# 2.6 Tuples

 # Accessing values in Tuples

In [28]:
tup = ('Math','98', 'C programming', '99')
print (tup) 
print(tup[1]) 
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

# Updating Tuples

In [29]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz'); 
#Following action is not valid for tuples 
#tup1[0] = 100; 
#So let's create a new tuple as follows 
tup3 = tup1 + tup2; 
print (tup3);

(12, 34.56, 'abc', 'xyz')

# Delete Tuple elements

In [30]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

# 2.7 Sets

In [31]:
#list
list1 = [1,2,3,4,5] 
print (type(list1)) 
my_set = set(list1) 
print(my_set) 
(type(my_set)) 
#set of integers 
my_set = {1,2,3} 
print (my_set) 
print
#set of mixed data types 
my_set = {1,"Hello", 1.2,'C'} 
#adding a single value 
my_set.add('D') 
#adding multiple values 
my_set.update(list1) 
print (my_set) 
my_set.discard('G') # it will not raise an error 
my_set.remove('G') # it will raise an error

<class 'list'>
{1, 2, 3, 4, 5}
{1, 2, 3}
{1, 'Hello', 1.2, 2, 3, 4, 5, 'C', 'D'}

KeyError: 'G'

# 3. Comparison Operators

In [32]:
1<3

True

In [33]:
15 <= 23

True

In [34]:
'Mehvish' == "Zeenat"

False

In [35]:
"Mehvish" != "Mehvish"

False

In [36]:
(1==1)or(5>2)

True

In [37]:
(1<2)and(2<1)

False

# 4. If-Else Statements

In [41]:
if 25 % 2 == 0:
    print('Even')
else:
    print('Odd')

Odd

# 5. For and While Loop

In [44]:
fact = 1
N = 5
for i in range(1, N + 1):
    fact *= i
print(fact)

120

In [46]:
 #example of while loop
a = 0
while a < 10: 
a = a+1
print(a)

IndentationError: expected an indented block after 'while' statement on line 3 (1174589057.py, line 4)

In [47]:
a = 0
while a < 10:
    a = a + 1
    print(a)

1
2
3
4
5
6
7
8
9
10

In [2]:
a = 0 
while a < 10:
    a = a+1
print (a)

10

 
# Functions

In [48]:
# Function definition
def printme(str):
    # This prints a passed string into this function
    print(str)
    return

# Now you can call printme function
printme("I'm first call to user defined function!")

I'm first call to user defined function!

# 7. Lambda Functions

In [7]:
# Normal function 
def f(x): 
    return x**2 

print(f(8))

64

In [8]:
def add(x, y):
    return x + y

print(add(5, 3))

8

In [9]:
add = lambda x, y: x + y
print(add(5, 3))

8

 # 7.1 Map()

In [10]:
sentence = 'It is raining cats and dogs' 
words = sentence.split()
print (words) 
lengths = map(lambda word: len(word), words) 
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

# 7.2 Filter()

In [11]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [12]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result2 = filter(lambda x: x % 2 == 0, fib) 
list (result2)

[0, 2, 8, 34]

# 8. File I/O

In [15]:
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name:  Ghualm Murtaza

Ghualm Murtaza

In [16]:
from six.moves import input
string = input("Enetr your name: ");
print(string)

Enetr your name:  Mehwish

Mehwish

# I/O from or to Text File

In [4]:
# Open a file to read 
fileOpen = open("GM.txt", "r+")

# To read specific content from start you can use read(12)
# It will read 12 characters from the start of file
str_content = fileOpen.read()

print(str_content)

# Close opened file 
fileOpen.close()

I am Ghulam Murtaza

In [22]:
# Open a file to append 
fileOpen = open("GM.txt", "a+") 
fileOpen.write(" Information Technology Lahore")
fileOpen.close()

# Open a file to read 
fileOpen = open("GM.txt", "r+") 
string = fileOpen.read()  # to read specific content from start, use read(12). It will read 12 characters from the start of file
print(string)

# Close opened file 
fileOpen.close()

I am Ghulam Murtaza, Information Technology Lahore

# File Position

In [24]:
# # Open a file
fo = open("GM.txt", "r+")

# Read first 10 characters
data = fo.read(10)
print("Read String is:\n", data)

# Check current position
position = fo.tell()
print("Current file position:\n", position)

# Reposition pointer at the beginning once again
fo.seek(0, 0)

# Read again first 10 characters
data = fo.read(10)
print("Again read String is:\n", data)

# Close open file
fo.close()

Read String is:
 I am Ghula
Current file position:
 10
Again read String is:
 I am Ghula

In [27]:
import os

In [29]:
os.rename("GM.txt","MI.txt")

In [30]:
os.remove("MI.txt")

 # 9. Pandas Introduction

In [32]:
import pandas as pd

# 10. Series

# 10.1 From ndarray

In [34]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [35]:
"""following a fucntion is called from panas to create a series. 
data would be 5 random values and indexes are assigned a-e"""
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e']) 
s

a    2.635688
b   -1.673682
c   -0.025848
d    1.280455
e   -0.376673
dtype: float64

# 10.2 From dict

In [37]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict""" 
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [38]:
""" In following example, index are given, so the values in data corresponding in the index will be pulled ou 
t""" 
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

# 10.3 From a scalar value

In [41]:
import pandas as pd
# In the following example, a scalar value is given as data
# so it will be repeated to match the length of index
s = pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])
print(s)

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

# 10.4 Series is ndarray-like

In [51]:
import pandas as pd

s = pd.Series([10, 20, 30])
print(s.iloc[0])   # Output: 10

10

In [55]:
#we can access a value just like ndarray 
#access single value 
(s.iloc[0])

np.int64(10)

In [57]:
 #access range of values 
s[:5]

a    10
b    20
c    30
dtype: int64

In [58]:
""" Following example will return a range of values in series whose value is greater than the median of serie 
s""" 
s[s > s.median()]

c    30
dtype: int64

In [60]:
s = pd.Series(['a', 'b', 'c', 'd', 'e'])

"""Following example returns the values in the Series with indexes 4, 3, and 1.
For example: the values at positions 4, 3, and 1 are 'e', 'd', and 'b' respectively."""
print(s[[4, 3, 1]])

4    e
3    d
1    b
dtype: object

In [63]:
import numpy as np
import pandas as pd

s = pd.Series([1, 2, 3, 4])

"""Following example returns the exponent values.
Just like e^a (here 'a' is each element of the Series)."""
print(np.exp(s))

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

In [65]:
s = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])

"""Following example will get the data of given index"""
print(s['a'])

10

In [67]:
s = pd.Series(np.exp([0, 1, 2, 3, 4]), index=['a', 'b', 'c', 'd', 'e'])

"""Following example will update the data of the given index"""
print("Before updating:")
print(s)

# Update value at index 'e'
s['e'] = 12.0

print("\nAfter updating:")
print(s)

Before updating:
a     1.000000
b     2.718282
c     7.389056
d    20.085537
e    54.598150
dtype: float64

After updating:
a     1.000000
b     2.718282
c     7.389056
d    20.085537
e    12.000000
dtype: float64

In [70]:

s = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])

"""Following will return True if 'e' is in the values of index otherwise False"""
print('e' in s)

True

In [71]:
"""If a label is not contained and you are trying to access its data, an exception is raised: """ 
s['f'] 
# This will create error

KeyError: 'f'

In [73]:
import pandas as pd
import numpy as np

s = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])

"""Using the get() method, a missing label will return None or a specified default"""
print(s.get('f'))          # It will return None
print(s.get('f', np.nan))  # It will return the default value (NaN)

None
nan

# 10.5 Vectorized operations and label alignment with Series

In [3]:
import pandas as pd

s = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])

"""following will add the data of respective values of indexes.
For example, in given output, it is calculated as:
a = s['a'] + s['a']
b = s['b'] + s['b']
c = s['c'] + s['c']
d = s['d'] + s['d']
e = s['e'] + s['e']
"""

# Perform addition
print(s + s)

a     20
b     40
c     60
d     80
e    100
dtype: int64

In [4]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca 
lculated as: 
a = s['a'] *2
 b = s['b'] *2
 c = s['c'] *2
 d = s['d'] *2 
e = s['e'] *2""" 
s * 2

a     20
b     40
c     60
d     80
e    100
dtype: int64

In [6]:

import numpy as np
s = pd.Series(np.random.randn(5), name='something') 
s

0    1.817697
1    1.625711
2   -0.905029
3    1.360455
4   -0.779222
Name: something, dtype: float64

In [7]:
s.name #print the name attribute of series

'something'

In [8]:
 #rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects. 
s2 = s.rename("different") 
s2.name

'different'

# 11. Data Frames

# 11.1 From dict of Series or dicts

In [10]:
import pandas as pd

"""A dict is created"""
d = { 
    'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']) 
}

# Create a DataFrame  row labels will be the index of the Series,
# and column labels will be the sorted list of dict keys.
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [12]:
"""A DataFrame will be constructed for given row labels"""
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [14]:
"""Following example shows a DataFrame when we give column labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [15]:
df.columns

Index(['one', 'two'], dtype='object')

# 11.2 From dict of ndarrays / lists

In [17]:
"""Following example shows that ndarray has same length"""
d = { 
    'one': [1., 2., 3., 4.],
    'two': [4., 3., 2., 1.] 
}

"""Column labels are not given so 
the result will be range(n), where n is the array length"""
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [18]:
 """If indexs are given then it would be same length as arrays"""
 pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

# 11.3 From a list of dict

In [20]:
"""Constructing DataFrame from a list of dicts""" 
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [22]:
"""Passing list of dicts as data and indexes (row labels)""" 
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [24]:
"""Passing list of dicts as data and columns (column labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

# 11.4 From a dict of tuples

In [25]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2}, 
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
 ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
 ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
 ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})
 #"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

# 11.5 Alternate Constructors

In [29]:
import numpy as np

data = np.zeros((2,), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'S10')])
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [30]:
 pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

In [32]:
import pandas as pd

pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
import pandas as pd

pd.DataFrame.from_dict(
    {'A': [1, 2, 3], 'B': [4, 5, 6]},
    orient='index',
    columns=['one', 'two', 'three']
)

   one  two  three
A    1    2      3
B    4    5      6

# 11.6 Column selection, addition, deletion

In [6]:
import pandas as pd

# Create the DataFrame first
df = pd.DataFrame.from_dict(
    {'A': [1, 2, 3], 'B': [4, 5, 6]},
    orient='index',
    columns=['one', 'two', 'three']
)

# Now you can access the column 'one'
df['one']

A    1
B    4
Name: one, dtype: int64

In [9]:
import pandas as pd

# Create a sample DataFrame
df = pd.DataFrame.from_dict(
    {'A': [1, 2, 3], 'B': [4, 5, 6]},
    orient='index',
    columns=['one', 'two', 'three']
)

# Assign a new column 'three' by multiplying columns 'one' and 'two'
df['three'] = df['one'] * df['two']

# Display the updated DataFrame
print(df)

   one  two  three
A    1    2      2
B    4    5     20

In [11]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame.from_dict(
    {'A': [1, 2, 3], 'B': [4, 5, 6]},
    orient='index',
    columns=['one', 'two', 'three']
)

# Add a new column using a condition
df['flag'] = df['one'] > 2

# Display the DataFrame
print(df)

   one  two  three   flag
A    1    2      3  False
B    4    5      6   True

In [12]:
 df #print a complete data frame

   one  two  three   flag
A    1    2      3  False
B    4    5      6   True

In [14]:
import pandas as pd

# Step 1: Create a DataFrame
df = pd.DataFrame.from_dict(
    {'A': {'one': 1, 'two': 2, 'three': 3},
     'B': {'one': 4, 'two': 5, 'three': 6}},
    orient='index'
)

print("Original DataFrame:")
print(df)
print("\n")

# Step 2: Add a new column 'flag' that checks if 'one' > 2
df['flag'] = df['one'] > 2
print("After adding 'flag' column:")
print(df)
print("\n")

# Step 3: Delete the column 'two'
del df['two']
print("After deleting 'two' column:")
print(df)

Original DataFrame:
   one  two  three
A    1    2      3
B    4    5      6


After adding 'flag' column:
   one  two  three   flag
A    1    2      3  False
B    4    5      6   True


After deleting 'two' column:
   one  three   flag
A    1      3  False
B    4      6   True

In [17]:
import pandas as pd

# Step 1: Create DataFrame
df = pd.DataFrame.from_dict(
    {'A': {'one': 1, 'two': 2, 'three': 3},
     'B': {'one': 4, 'two': 5, 'three': 6}},
    orient='index'
)

# Step 2: Add a 'flag' column
df['flag'] = df['one'] > 2

# Step 3: Delete column 'two'
del df['two']

# Step 4: Pop the 'three' column and store it separately
three = df.pop('three')

print("Updated DataFrame:")
print(df)
print("\nPopped Column 'three':")
print(three)

Updated DataFrame:
   one   flag
A    1  False
B    4   True

Popped Column 'three':
A    3
B    6
Name: three, dtype: int64

In [18]:
df

   one   flag
A    1  False
B    4   True

In [20]:
import pandas as pd

# Create sample DataFrame
df = pd.DataFrame({
    'one': [1, 4],
    'flag': [False, True]
}, index=['A', 'B'])

# Add new column 'foo' filled with the same value 'bar'
df['foo'] = 'bar'

print(df)

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [22]:
import pandas as pd

# Step 1: Create a DataFrame
df = pd.DataFrame.from_dict(
    {'A': {'one': 1, 'two': 2, 'three': 3},
     'B': {'one': 4, 'two': 5, 'three': 6}},
    orient='index'
)

print("Original DataFrame:")
print(df)
print("\n")

# Step 2: Add a new column 'flag' that checks if 'one' > 2
df['flag'] = df['one'] > 2
print("After adding 'flag' column:")
print(df)
print("\n")

# Step 3: Delete the column 'two'
del df['two']
print("After deleting 'two' column:")
print(df)
print("\n")

# Step 4: Pop (remove + save) column 'three'
three = df.pop('three')
print("After popping 'three' column:")
print(df)
print("\nPopped column 'three':")
print(three)
print("\n")

# Step 5: Add a new column 'foo' filled with the same value 'bar'
df['foo'] = 'bar'
print("After adding 'foo' column:")
print(df)

Original DataFrame:
   one  two  three
A    1    2      3
B    4    5      6


After adding 'flag' column:
   one  two  three   flag
A    1    2      3  False
B    4    5      6   True


After deleting 'two' column:
   one  three   flag
A    1      3  False
B    4      6   True


After popping 'three' column:
   one   flag
A    1  False
B    4   True

Popped column 'three':
A    3
B    6
Name: three, dtype: int64


After adding 'foo' column:
   one   flag  foo
A    1  False  bar
B    4   True  bar

In [23]:
df

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [25]:
import pandas as pd

# Step 1: Create DataFrame
df = pd.DataFrame({
    'one': [1, 4],
    'flag': [False, True],
    'foo': ['bar', 'bar']
}, index=['A', 'B'])

print("Original DataFrame:")
print(df)
print("\n")

# Step 2: Create new column taking first two values from 'one'
df['one_trunc'] = df['one'][:2]

print("After adding 'one_trunc' column:")
print(df)

Original DataFrame:
   one   flag  foo
A    1  False  bar
B    4   True  bar


After adding 'one_trunc' column:
   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [26]:
df

   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [28]:
import pandas as pd

# Step 1: Create sample DataFrame
df = pd.DataFrame({
    'one': [1, 4],
    'flag': [False, True],
    'foo': ['bar', 'bar'],
    'one_trunc': [1, 4]
}, index=['A', 'B'])

print("Original DataFrame:")
print(df)
print("\n")

# Step 2: Insert a new column 'bar2' at position 1, copying data from 'one'
df.insert(1, 'bar2', df['one'])

print("After inserting 'bar2' column at position 1:")
print(df)

Original DataFrame:
   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4


After inserting 'bar2' column at position 1:
   one  bar2   flag  foo  one_trunc
A    1     1  False  bar          1
B    4     4   True  bar          4

 # 11.7 Indexing / Selection

In [30]:
df.loc['B'] #it will return the coloumn labels and values on row label 'b'

one             4
bar2            4
flag         True
foo           bar
one_trunc       4
Name: B, dtype: object

In [33]:
df[df['one'] > 2] #it will return the values of those coloumns that is > than 2

   one  bar2  flag  foo  one_trunc
B    4     4  True  bar          4

# 11.8 Data alignment and arithmetic

In [36]:
import pandas as pd
import numpy as np

# Create a DataFrame with 10 rows and 4 columns (A, B, C, D)
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

# Display the DataFrame
df

          A         B         C         D
0  0.647641  1.377056  0.064393 -0.277874
1 -1.341006 -1.005732  0.248058  0.400396
2 -0.462501 -1.132244 -0.564525 -2.426218
3 -0.329402 -0.403397  1.413450 -0.503939
4 -0.106732 -1.071753 -0.553128  2.029760
5 -1.146245  1.087430  0.609479 -1.251280
6  0.396097 -1.641436 -1.861755 -0.106213
7 -0.737235  0.999307  0.295056  0.507212
8  0.440581  0.686833 -0.232363  0.703085
9 -0.067642 -0.927738  0.170429  2.450641

In [38]:
import pandas as pd
import numpy as np

# Create a DataFrame with 7 rows and 3 columns
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

# Display the DataFrame
df2

          A         B         C
0 -2.430201 -0.695497  0.124563
1  0.994034  0.444812  0.348765
2  1.346697 -0.050486 -0.103063
3  0.749331 -0.717702  0.151123
4  0.672462  0.071680 -0.523016
5 -0.040160 -1.143738  1.890624
6 -0.839778  1.192723  0.961897

In [39]:
df + df2 # add values of respective coloumn labels

          A         B         C   D
0 -1.782560  0.681560  0.188956 NaN
1 -0.346972 -0.560920  0.596823 NaN
2  0.884196 -1.182730 -0.667588 NaN
3  0.419929 -1.121099  1.564573 NaN
4  0.565730 -1.000073 -1.076143 NaN
5 -1.186405 -0.056308  2.500104 NaN
6 -0.443680 -0.448713 -0.899858 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [40]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -1.988647 -2.382788  0.183665  0.678269
2 -1.110143 -2.509300 -0.628918 -2.148344
3 -0.977043 -1.780453  1.349057 -0.226066
4 -0.754373 -2.448809 -0.617521  2.307634
5 -1.793886 -0.289626  0.545086 -0.973406
6 -0.251544 -3.018492 -1.926148  0.171661
7 -1.384876 -0.377749  0.230663  0.785086
8 -0.207060 -0.690223 -0.296756  0.980959
9 -0.715284 -2.304795  0.106036  2.728514

In [41]:
df*5+2

          A         B         C          D
0  5.238206  8.885281  2.321964   0.610632
1 -4.705029 -3.028661  3.240290   4.001978
2 -0.312507 -3.661220 -0.822625 -10.131088
3  0.352989 -0.016986  9.067250  -0.519696
4  1.466342 -3.358766 -0.765639  12.148800
5 -3.731223  7.437151  5.047396  -4.256400
6  3.980486 -6.207181 -7.308776   1.468936
7 -1.686176  6.996536  3.475279   4.536061
8  4.202906  5.434163  0.838186   5.515426
9  1.661788 -2.638692  2.852146  14.253204

In [42]:
1 / df

           A         B          C         D
0   1.544065  0.726187  15.529671 -3.598758
1  -0.745709 -0.994300   4.031316  2.497530
2  -2.162156 -0.883202  -1.771400 -0.412164
3  -3.035803 -2.478947   0.707489 -1.984366
4  -9.369305 -0.933051  -1.807900  0.492669
5  -0.872414  0.919599   1.640745 -0.799182
6   2.524633 -0.609223  -0.537128 -9.415058
7  -1.356419  1.000693   3.389189  1.971561
8   2.269729  1.455959  -4.303614  1.422303
9 -14.783625 -1.077890   5.867537  0.408057

In [43]:
df **4

          A         B          C          D
0  0.175929  3.595892   0.000017   0.005962
1  3.233871  1.023127   0.003786   0.025701
2  0.045756  1.643463   0.101562  34.651252
3  0.011773  0.026481   3.991369   0.064493
4  0.000130  1.319408   0.093606  16.973786
5  1.726272  1.398317   0.137986   2.451422
6  0.024615  7.259323  12.014073   0.000127
7  0.295409  0.997231   0.007579   0.066185
8  0.037679  0.222538   0.002915   0.244361
9  0.000021  0.740802   0.000844  36.067719

In [45]:
import pandas as pd

# Create a DataFrame with Boolean values
df1 = pd.DataFrame({
    'a': [1, 0, 1],
    'b': [0, 1, 1]
}, dtype=bool)

# Display the DataFrame
df1

       a      b
0   True  False
1  False   True
2   True   True

In [46]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [47]:
import pandas as pd

# Create Boolean DataFrame df1
df1 = pd.DataFrame({
    'a': [1, 0, 1],
    'b': [0, 1, 1]
}, dtype=bool)

# Create Boolean DataFrame df2
df2 = pd.DataFrame({
    'a': [0, 1, 1],
    'b': [1, 1, 0]
}, dtype=bool)

# Display both DataFrames
print("df1:")
print(df1, "\n")

print("df2:")
print(df2)

df1:
       a      b
0   True  False
1  False   True
2   True   True

df2:
       a      b
0  False   True
1   True   True
2   True  False

In [48]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [49]:
 df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [50]:
 df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [51]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

# 11.9 Transposing

In [53]:
import pandas as pd
import numpy as np

# Create a sample DataFrame
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

# Show only the first 5 rows, then transpose it
df[:5].T

          0         1         2         3         4
A -1.381173 -1.152617  0.029465  0.283669  0.092115
B -0.354344 -1.431402 -0.428702  0.730492  0.417909
C -1.305962  0.237696 -1.081018  2.753169  0.672409
D -0.491533  1.909681  1.339636  0.476928  1.181571

In [54]:
dates = pd.date_range('20130101', periods=6)

In [55]:
import pandas as pd

# Create a date range starting from 2013-01-01 with 6 periods (days)
dates = pd.date_range('20130101', periods=6)

# Display the generated date range
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [56]:
 df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [57]:
import pandas as pd
import numpy as np

# Create a date range
dates = pd.date_range('20130101', periods=6)

# Create a DataFrame with random numbers and date index
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

# Display the DataFrame
df

                   A         B         C         D
2013-01-01 -1.071568  0.431405  0.304315  0.655069
2013-01-02 -0.856755 -1.302108  1.150707  1.019978
2013-01-03  0.098031 -0.834441  1.573949 -0.401324
2013-01-04 -0.673691 -0.164664  1.916668 -0.493653
2013-01-05 -0.398289 -0.595746  0.137689 -0.826929
2013-01-06  0.055122 -0.051880 -0.941307 -0.274189

In [58]:
df

                   A         B         C         D
2013-01-01 -1.071568  0.431405  0.304315  0.655069
2013-01-02 -0.856755 -1.302108  1.150707  1.019978
2013-01-03  0.098031 -0.834441  1.573949 -0.401324
2013-01-04 -0.673691 -0.164664  1.916668 -0.493653
2013-01-05 -0.398289 -0.595746  0.137689 -0.826929
2013-01-06  0.055122 -0.051880 -0.941307 -0.274189

In [61]:
import pandas as pd
import numpy as np

df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo'
})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [62]:
#Having specific dtypes 
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

# 12. Viewing Data

In [63]:
df.head() #display first 5 records

                   A         B         C         D
2013-01-01 -1.071568  0.431405  0.304315  0.655069
2013-01-02 -0.856755 -1.302108  1.150707  1.019978
2013-01-03  0.098031 -0.834441  1.573949 -0.401324
2013-01-04 -0.673691 -0.164664  1.916668 -0.493653
2013-01-05 -0.398289 -0.595746  0.137689 -0.826929

In [64]:
df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04 -0.673691 -0.164664  1.916668 -0.493653
2013-01-05 -0.398289 -0.595746  0.137689 -0.826929
2013-01-06  0.055122 -0.051880 -0.941307 -0.274189

In [65]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [66]:
df.columns #display coloumns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [67]:
df.values # print values

array([[-1.07156814,  0.43140478,  0.3043147 ,  0.65506915],
       [-0.85675468, -1.30210771,  1.15070663,  1.01997803],
       [ 0.09803105, -0.83444093,  1.57394892, -0.40132394],
       [-0.6736913 , -0.16466408,  1.9166679 , -0.49365349],
       [-0.39828906, -0.59574621,  0.13768872, -0.82692925],
       [ 0.05512176, -0.0518798 , -0.94130748, -0.27418899]])

In [68]:
# Transposing your data 
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.071568   -0.856755    0.098031   -0.673691   -0.398289    0.055122
B    0.431405   -1.302108   -0.834441   -0.164664   -0.595746   -0.051880
C    0.304315    1.150707    1.573949    1.916668    0.137689   -0.941307
D    0.655069    1.019978   -0.401324   -0.493653   -0.826929   -0.274189

In [69]:
 #Sorting by an axis
 df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.655069  0.304315  0.431405 -1.071568
2013-01-02  1.019978  1.150707 -1.302108 -0.856755
2013-01-03 -0.401324  1.573949 -0.834441  0.098031
2013-01-04 -0.493653  1.916668 -0.164664 -0.673691
2013-01-05 -0.826929  0.137689 -0.595746 -0.398289
2013-01-06 -0.274189 -0.941307 -0.051880  0.055122

In [71]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.856755 -1.302108  1.150707  1.019978
2013-01-03  0.098031 -0.834441  1.573949 -0.401324
2013-01-05 -0.398289 -0.595746  0.137689 -0.826929
2013-01-04 -0.673691 -0.164664  1.916668 -0.493653
2013-01-06  0.055122 -0.051880 -0.941307 -0.274189
2013-01-01 -1.071568  0.431405  0.304315  0.655069

In [75]:
# Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.474525 -0.419572  0.690337 -0.053508
std    0.480913  0.617472  1.059556  0.723331
min   -1.071568 -1.302108 -0.941307 -0.826929
25%   -0.810989 -0.774767  0.179345 -0.470571
50%   -0.535990 -0.380205  0.727511 -0.337756
75%   -0.058231 -0.080076  1.468138  0.422755
max    0.098031  0.431405  1.916668  1.019978

In [76]:
#Selecting a single column, which yields a Series, equivalent to df.A 
df['A']

2013-01-01   -1.071568
2013-01-02   -0.856755
2013-01-03    0.098031
2013-01-04   -0.673691
2013-01-05   -0.398289
2013-01-06    0.055122
Freq: D, Name: A, dtype: float64

In [77]:
 #Selecting via [], which slices the rows. 
df[0:3]

                   A         B         C         D
2013-01-01 -1.071568  0.431405  0.304315  0.655069
2013-01-02 -0.856755 -1.302108  1.150707  1.019978
2013-01-03  0.098031 -0.834441  1.573949 -0.401324

In [78]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.856755 -1.302108  1.150707  1.019978
2013-01-03  0.098031 -0.834441  1.573949 -0.401324
2013-01-04 -0.673691 -0.164664  1.916668 -0.493653

In [79]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.071568  0.431405
2013-01-02 -0.856755 -1.302108
2013-01-03  0.098031 -0.834441
2013-01-04 -0.673691 -0.164664
2013-01-05 -0.398289 -0.595746
2013-01-06  0.055122 -0.051880

In [80]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.856755 -1.302108
2013-01-03  0.098031 -0.834441
2013-01-04 -0.673691 -0.164664

In [81]:
# Reduction in the dimensions of the returned object 
df.loc['20130102',['A','B']]

A   -0.856755
B   -1.302108
Name: 2013-01-02 00:00:00, dtype: float64

In [82]:
 # For getting a scalar value 
df.loc[dates[0],'A']

np.float64(-1.0715681414566995)

In [84]:
 # For getting fast access to a scalar 
df.at[dates[0],'A']

np.float64(-1.0715681414566995)

In [85]:
# Select via the position of the passed integers 
df.iloc[3]

A   -0.673691
B   -0.164664
C    1.916668
D   -0.493653
Name: 2013-01-04 00:00:00, dtype: float64

In [86]:
# By integer slices, acting similar to numpy/python 
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.673691 -0.164664
2013-01-05 -0.398289 -0.595746

In [87]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.856755  1.150707
2013-01-03  0.098031  1.573949
2013-01-05 -0.398289  0.137689

In [88]:
# For slicing rows explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01  0.431405  0.304315
2013-01-02 -1.302108  1.150707
2013-01-03 -0.834441  1.573949
2013-01-04 -0.164664  1.916668
2013-01-05 -0.595746  0.137689
2013-01-06 -0.051880 -0.941307

In [89]:
# For getting a value explicitly 
df.iloc[1,1]

np.float64(-1.302107708092155)

In [90]:
 # Using a single columns values to select data. 
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.098031 -0.834441  1.573949 -0.401324
2013-01-06  0.055122 -0.051880 -0.941307 -0.274189

In [91]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.431405  0.304315  0.655069
2013-01-02       NaN       NaN  1.150707  1.019978
2013-01-03  0.098031       NaN  1.573949       NaN
2013-01-04       NaN       NaN  1.916668       NaN
2013-01-05       NaN       NaN  0.137689       NaN
2013-01-06  0.055122       NaN       NaN       NaN

In [99]:
# Using the isin() method for filtering:
df2 = df.copy()

In [100]:
df2['E'] = ['one', 'one','two','three','four','three']

In [101]:
df2

                   A         B         C         D      E
2013-01-01 -0.324555  1.085080  1.081497  0.690047    one
2013-01-02 -2.983032 -1.470266  0.275022  0.506644    one
2013-01-03  0.567675  0.901147 -0.519207  0.851028    two
2013-01-04  0.179563 -0.476673  1.550795 -1.184131  three
2013-01-05  0.190349  0.063650  0.126106  0.340981   four
2013-01-06  1.468225 -0.023040  1.986468  0.189731  three

In [102]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.567675  0.901147 -0.519207  0.851028   two
2013-01-05  0.190349  0.063650  0.126106  0.340981  four